In [1]:
import pandas as pd

In [10]:
df1=pd.DataFrame({'A':['a0','a1','a2','a3'],
      'B':['b0','b1','b2','b3'],
      'C':['c0','c1','c2','c3']},
       index=[0,1,2,3])

In [12]:
df2=pd.DataFrame({'A':['a4','a5','a6','a7'],
     'B':['b4','b5','b6','b7'],
     'C':['c4','c5','c6','c7']},
    index=[4,5,6,7])

In [13]:
df3=pd.DataFrame({'A':['a8','a9','a10','a11'],
                 'B':['b8','b9','b10','b11'],
                 'C':['c8','c9','c10','c11']},
                index=[8,9,10,11])

In [17]:
df1

    A   B   C
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

##

In [21]:
df2

    A   B   C
4  a4  b4  c4
5  a5  b5  c5
6  a6  b6  c6
7  a7  b7  c7

In [19]:
df3

      A    B    C
8    a8   b8   c8
9    a9   b9   c9
10  a10  b10  c10
11  a11  b11  c11

In [22]:
pd.concat([df1,df2,df3])

      A    B    C
0    a0   b0   c0
1    a1   b1   c1
2    a2   b2   c2
3    a3   b3   c3
4    a4   b4   c4
5    a5   b5   c5
6    a6   b6   c6
7    a7   b7   c7
8    a8   b8   c8
9    a9   b9   c9
10  a10  b10  c10
11  a11  b11  c11

In [24]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    A    B    C    A    B    C
0    a0   b0   c0  NaN  NaN  NaN  NaN  NaN  NaN
1    a1   b1   c1  NaN  NaN  NaN  NaN  NaN  NaN
2    a2   b2   c2  NaN  NaN  NaN  NaN  NaN  NaN
3    a3   b3   c3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   a4   b4   c4  NaN  NaN  NaN
5   NaN  NaN  NaN   a5   b5   c5  NaN  NaN  NaN
6   NaN  NaN  NaN   a6   b6   c6  NaN  NaN  NaN
7   NaN  NaN  NaN   a7   b7   c7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   a8   b8   c8
9   NaN  NaN  NaN  NaN  NaN  NaN   a9   b9   c9
10  NaN  NaN  NaN  NaN  NaN  NaN  a10  b10  c10
11  NaN  NaN  NaN  NaN  NaN  NaN  a11  b11  c11

In [27]:
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'A':['a0','a1','a2','a3'],
                  'B':['b0','b1','b2','b3']})
right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                   'C':['c0','c1','c2','c3']})

In [28]:
left

  key   A   B
0  k0  a0  b0
1  k1  a1  b1
2  k2  a2  b2
3  k3  a3  b3

In [29]:
right

  key   C
0  k0  c0
1  k1  c1
2  k2  c2
3  k3  c3

In [30]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C
0  k0  a0  b0  c0
1  k1  a1  b1  c1
2  k2  a2  b2  c2
3  k3  a3  b3  c3

In [40]:
left=pd.DataFrame({'key1':['k0','k1','k2','k3'],
                   'key2':['k0','k1','k2','k3'],
                  'A':['a0','a1','a2','a3'],
                  'B':['b0','b1','b2','b3']})

right=pd.DataFrame({'key1':['k0','k1','k2','k3'],
                    'key2':['k0','k1','k2','k3'],
                   'C':['c0','c1','c2','c3'],
                   'D':['d0','d1','d2','d3']})

In [41]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   k0   k0  a0  b0  c0  d0
1   k1   k1  a1  b1  c1  d1
2   k2   k2  a2  b2  c2  d2
3   k3   k3  a3  b3  c3  d3

In [43]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2   A   B   C   D
0   k0   k0  a0  b0  c0  d0
1   k1   k1  a1  b1  c1  d1
2   k2   k2  a2  b2  c2  d2
3   k3   k3  a3  b3  c3  d3

In [47]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[44,55,44,77],'col3':['aa','bb','cc','dd']})

In [48]:
df

   col1  col2 col3
0     1    44   aa
1     2    55   bb
2     3    44   cc
3     4    77   dd

In [50]:
df['col2'].nunique()

3

In [52]:
df['col2'].value_counts()

44    2
77    1
55    1
Name: col2, dtype: int64

In [57]:
df[df['col1']==3]

   col1  col2 col3
2     3    44   cc

In [59]:
def sq(x):
    return x**2

In [60]:
df['col2'].apply(sq)

0    1936
1    3025
2    1936
3    5929
Name: col2, dtype: int64

In [61]:
df['col2'].sum()

220

In [64]:
df

   col2 col3
0    44   aa
1    55   bb
2    44   cc
3    77   dd

In [69]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [70]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [71]:
df.sort_values(by='col2')

   col2 col3
0    44   aa
2    44   cc
1    55   bb
3    77   dd

In [72]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [73]:
df.dropna()

   col2 col3
0    44   aa
1    55   bb
2    44   cc
3    77   dd

In [81]:
import numpy as np

In [84]:
df=pd.DataFrame({'col1':[1,2,3,np.nan],
                'col2':[np.nan,555,666,111],
                'col3':['abc','def','ghu','mju']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghu
3   NaN  111.0  mju

In [91]:
df.fillna('***')

  col1   col2 col3
0  1.0    ***  abc
1  2.0  555.0  def
2  3.0  666.0  ghu
3  ***  111.0  mju

In [103]:
data=({'A':['kkk','kkk','ggg','ggg'],
                    'B':['one','two','two','one'],
                   'C':[0,1,2,3],
                   'D':['d','dd','d','dd']})

In [104]:
df=pd.DataFrame(data)

In [105]:
df

     A    B  C   D
0  kkk  one  0   d
1  kkk  two  1  dd
2  ggg  two  2   d
3  ggg  one  3  dd

In [106]:
df.pivot_table(values='C',index=['A','B'],columns='D')

D          d   dd
A   B
ggg one  NaN  3.0
    two  2.0  NaN
kkk one  0.0  NaN
    two  NaN  1.0

In [107]:
df

     A    B  C   D
0  kkk  one  0   d
1  kkk  two  1  dd
2  ggg  two  2   d
3  ggg  one  3  dd